Revit 2027 API
BuiltInFailures.ViewSheetFailures.ViewportCantContainEmptyView Property
 Sheet views cannot contain empty view "%1!s!".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewportCantContainEmptyView { get; }
Public Shared ReadOnly Property ViewportCantContainEmptyView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewportCantContainEmptyView {
	FailureDefinitionId^ get ();
}
static member ViewportCantContainEmptyView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace